//某自来水公司，采用按月分段计费的方法来收取水费。
//12吨以内（含）按2.5元单价收取，12吨到20吨（含）的部分，按3.8元单价，20吨以上部分，
//按4.2元单价收取。尝试编写程序，实现输入用水吨数，输出需要支付水费金额。
#include<iostream>
using namespace std;
int main() {
	float a,b,c;
	cin>>a;
	if(a<=12) {
//		cout<<"dbg:a*2.5="<<a*2.5<<"元"<<endl;
		cout<<a*2.5<<"元";

	} else if(a<=20) {
//		cout<<"dbg:12*2.5="<<12*2.5<<"元"<<endl;
//		cout<<"dbg:(a-12)*3.8="<<(a-12)*3.8<<"元"<<endl;
		cout<<12*2.5+(a-12)*3.8<<"元";

	} else {
//		cout<<"dbg:12*2.5="<<12*2.5<<"元"<<endl;
//		cout<<"dbg:8*3.8="<<8*3.8<<"元"<<endl;
//		cout<<"dbg:(a-20)*4.2="<<(a-20)*4.2<<"元"<<endl;
		cout<<12*2.5+8*3.8+(a-20)*4.2<<"元";
	}
	return 0;
}
